<a href="https://colab.research.google.com/github/vivekml2/MachineLearning/blob/main/Expedia_Hotel_Recommendations_kaggle.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#importing libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
train = pd.read_csv('/content/drive/MyDrive/train.csv', nrows=100000)
test = pd.read_csv('/content/drive/MyDrive/test.csv',nrows=100000)

In [4]:
train.head()

             date_time  site_name  ...  hotel_market  hotel_cluster
0  2014-08-11 07:46:59          2  ...           628              1
1  2014-08-11 08:22:12          2  ...           628              1
2  2014-08-11 08:24:33          2  ...           628              1
3  2014-08-09 18:05:16          2  ...          1457             80
4  2014-08-09 18:08:18          2  ...          1457             21

[5 rows x 24 columns]